mymy49/yss/yss/inc/drv/gpio/define_gpio_stm32f4_f7_g4.h
////////////////////////////////////////////////////////////////////////////////////////
//
// 저작권 표기 License_ver_2.0
// 본 소스코드의 소유권은 yss Embedded Operating System 네이버 카페 관리자와 운영진에게 있습니다.
// 운영진이 임의로 코드의 권한을 타인에게 양도할 수 없습니다.
// 본 소스코드는 아래 사항에 동의할 경우에 사용 가능합니다.
// 아래 사항에 대해 동의하지 않거나 이해하지 못했을 경우 사용을 금합니다.
// 본 소스코드를 사용하였다면 아래 사항을 모두 동의하는 것으로 자동 간주 합니다.
// 본 소스코드의 상업적 또는 비상업적 이용이 가능합니다.
// 본 소스코드의 내용을 임의로 수정하여 재배포하는 행위를 금합니다.
// 본 소스코드의 내용을 무단 전재하는 행위를 금합니다.
// 본 소스코드의 사용으로 인해 발생하는 모든 사고에 대해서 어떤한 법적 책임을 지지 않습니다.
//
//  Home Page : http://cafe.naver.com/yssoperatingsystem
//  Copyright 2021. yss Embedded Operating System all right reserved.
//
//  주담당자 : 아이구 (mymy49@nate.com) 2016.04.30 ~ 현재
//  부담당자 : -
//
////////////////////////////////////////////////////////////////////////////////////////

#ifndef YSS_DRV_GPIO_ST_TYPE_A_DEFINE__H_
#define YSS_DRV_GPIO_ST_TYPE_A_DEFINE__H_

#include <yss/mcu.h>

#if defined(STM32F7) || defined(STM32F4) || defined(STM32G4) || defined(STM32L0) || defined(STM32L4) || defined(STM32F0)

namespace define
{
namespace gpio
{
namespace altfunc
{
#if defined(STM32F4)
enum
{
	PA0_TIM2_CH1 = 1,
	PA0_TIM2_ETR = 1,
	PA0_TIM5_CH1 = 2,
	PA0_USART2_CTS = 7,
	PA0_UART4_TX = 8,
	PA0_ETH_MII_CRS = 11,
	PA0_EVENTOUT = 15,

	PA1_TIM2_CH2 = 1,
	PA1_TIM5_CH2 = 2,
	PA1_USART2_RTS = 7,
	PA1_UART4_RX = 8,
	PA1_ETH_MII_RX_CLK = 11,
	PA1_ETH_RMII_REF_CLK = 11,
	PA1_EVENTOUT = 15,

	PA2_TIM2_CH3 = 1,
	PA2_TIM5_CH3 = 2,
	PA2_TIM9_CH1 = 3,
	PA2_USART2_TX = 7,
	PA2_ETH_MDIO = 11,
	PA2_EVENTOUT = 15,

	PA3_TIM2_CH4 = 1,
	PA3_TIM5_CH4 = 2,
	PA3_TIM9_CH2 = 3,
	PA3_USART2_RX = 7,
	PA3_OTG_HS_ULPI_D0 = 10,
	PA3_ETH_MII_COL = 11,
	PA3_LCD_B5 = 14,
	PA3_EVENTOUT = 15,
	
	PA4_SPI1_NSS = 5,
	PA4_SPI3_NSS = 6,
	PA4_I2S3_WS = 6,
	PA4_USART2_CK = 7,
	PA4_OTG_HS_SOF = 12,
	PA4_DCMI_HSYNC = 13,
	PA4_LCD_VSYNC = 14,
	PA4_EVENTOUT = 15,
	
	PA5_TIM2_CH1 = 1,
	PA5_TIM2_ETR = 1,
	PA5_TIM8_CH1N = 3,
	PA5_SPI1_SCK = 5,
	PA5_OTG_HS_ULPI_CK = 10,
	PA5_EVENTOUT = 15,

	PA6_TIM1_BKIN = 1,
	PA6_TIM3_CH1 = 2,
	PA6_TIM8_BKIN = 3,
	PA6_SPI1_MISO = 5,
	PA6_TIM13_CH1 = 9,
	PA6_DCMI_PIXCLK = 13,
	PA6_LCD_G2 = 14,
	PA6_EVENTOUT = 15,

	PA7_TIM1_CH1N = 1,
	PA7_TIM3_CH2 = 2,
	PA7_TIM8_CH1N = 3,
	PA7_SPI1_MOSI = 5,
	PA7_TIM14_CH1 = 9,
	PA7_ETH_MII_RX_DV = 11,
	PA7_ETH_RMII_CRS_DV = 11,
	PA7_EVENTOUT = 15,

	PA8_MCO1 = 0,
	PA8_TIM1_CH1 = 1,
	PA8_I2C3_SCL = 4,
	PA8_USART1_CK = 7,
	PA8_OTG_FS_SOF = 10,
	PA8_LCD_R6 = 14,
	PA8_EVENTOUT = 15,

	PA9_TIM1_CH2 = 1,
	PA9_I2C3_SMBA = 4,
	PA9_USART1_TX = 7,
	PA9_DCMI_D0 = 13,
	PA9_EVENTOUT = 15,

	PA10_TIM1_CH3 = 1,
	PA10_USART1_RX = 7,
	PA10_OTG_FS_ID = 10,
	PA10_DCMI_D1 = 13,
	PA10_EVENTOUT = 15,

	PA11_TIM1_CH4 = 1,
	PA11_USART1_CTS = 7,
	PA11_CAN1_RX = 9,
	PA11_OTG_FS_DM = 10,
	PA11_LCD_R4 = 14,
	PA11_EVENTOUT = 15,

	PA12_TIM1_ETR = 1,
	PA12_USART1_RTS = 7,
	PA12_CAN1_TX = 9,
	PA12_OTG_FS_DP = 10,
	PA12_LCD_R5 = 14,
	PA12_EVENTOUT = 15,

	PA13_JTMS = 0,
	PA13_SWDIO = 0,
	PA13_EVENTOUT = 15,

	PA14_JTCK = 0,
	PA14_SWCLK = 0,
	PA14_EVENTOUT = 15,

	PA15_JTDI = 0,
	PA15_TIM2_CH1 = 1,
	PA15_TIM2_ETR = 1,
	PA15_SPI1_NSS = 5,
	PA15_SPI3_NSS = 6,
	PA15_I2S3_WS = 6,
	PA15_EVENTOUT = 15,

	PB0_TIM1_CH2N = 1,
	PB0_TIM3_CH3 = 2,
	PB0_TIM8_CH2N = 3,
	PB0_LCD_R3 = 9,
	PB0_OTG_HS_ULPI_D1 = 10,
	PB0_ETH_MII_RXD2 = 11,
	PB0_EVENTOUT = 15,

	PB1_TIM1_CH3N = 1,
	PB1_TIM3_CH4 = 2,
	PB1_TIM8_CH3N = 3,
	PB1_LCD_R6 = 9,
	PB1_OTG_HS_ULPI_D2 = 10,
	PB1_ETH_MII_RXD3 = 11,
	PB1_EVENTOUT = 15,

	PB2_EVENTOUT = 15,

	PB3_JTDO = 0,
	PB3_TRACESWO = 0,
	PB3_TIM2_CH2 = 1,
	PB3_SPI1_SCK = 5,
	PB3_SPI3_SCK = 6,
	PB3_I2S3_CK = 6,
	PB3_EVENTOUT = 15,

	PB4_NJTRST = 0,
	PB4_TIM3_CH1 = 2,
	PB4_SPI1_MISO = 5,
	PB4_SPI3_MISO = 6,
	PB4_I2S3_EXT_SD = 7,
	PB4_EVENTOUT = 15,

	PB5_TIM3_CH2 = 2,
	PB5_I2C1_SMBA = 4,
	PB5_SPI1_MOSI = 5,
	PB5_SPI3_MOSI = 6,
	PB5_I2S3_SD = 6,
	PB5_CAN2_RX = 9,
	PB5_OTG_HS_ULPI_D7 = 10,
	PB5_ETH_PPS_OUT = 11,
	PB5_FMC_SDCKE1 = 12,
	PB5_DCMI_D10 = 13,
	PB5_EVENTOUT = 15,

	PB6_TIM4_CH1 = 2,
	PB6_I2C1_SCL = 4,
	PB6_USART1_TX = 7,
	PB6_CAN2_TX = 9,
	PB6_FMC_SDNE1 = 12,
	PB6_DCMI_D5 = 13,
	PB6_EVENTOUT = 15,

	PB7_TIM4_CH2 = 2,
	PB7_I2C1_SDA = 4,
	PB7_USART1_RX = 7,
	PB7_FMC_NL = 12,
	PB7_DCMI_VSYNC = 13,
	PB7_EVENTOUT = 15,

	PB8_TIM4_CH3 = 2,
	PB8_TIM10_CH1 = 3,
	PB8_I2C1_SCL = 4,
	PB8_CAN1_RX = 9,
	PB8_ETH_MII_TXD3 = 11,
	PB8_SDIO_D4 = 12,
	PB8_DCMI_D6 = 13,
	PB8_LCD_B6 = 14,
	PB8_EVENTOUT = 15,

	PB9_TIM4_CH4 = 2,
	PB9_TIM11_CH1 = 3,
	PB9_I2C1_SDA = 4,
	PB9_SPI2_NSS = 5,
	PB9_I2S2_WS = 5,
	PB9_CAN1_TX = 9,
	PB9_SDIO_D5 = 12,
	PB9_DCMI_D7 = 13,
	PB9_LCD_B7 = 14,
	PB9_EVENTOUT = 15,

	PB10_TIM2_CH3 = 1,
	PB10_I2C2_SCL = 4,
	PB10_SPI2_SCK = 5,
	PB10_I2S2_CK = 5,
	PB10_USART3_TX = 7,
	PB10_OTG_HS_ULPI_D3 = 10,
	PB10_ETH_MII_RX_ER = 11,
	PB10_LCD_G4 = 14,
	PB10_EVENTOUT = 15,

	PB11_TIM2_CH4 = 1,
	PB11_I2C2_SDA = 4,
	PB11_USART3_RX = 7,
	PB11_OTG_HS_ULPI_D4 = 10,
	PB11_ETH_MII_TX_EN = 11,
	PB11_ETH_RMII_TX_EN = 11,
	PB11_LCD_G5 = 14,
	PB11_EVENTOUT = 15,

	PB12_TIM1_BKIN = 1,
	PB12_I2C2_SMBA = 4,
	PB12_SPI2_NSS = 5,
	PB12_I2S2_WS = 5,
	PB12_USART3_CK = 7,
	PB12_CAN2_RX = 9,
	PB12_OTG_HSULPI_D5 = 10,
	PB12_ETH_MII_TXD0 = 11,
	PB12_ETH_RMII_TXD0 = 11,
	PB12_OTG_HS_ID = 12,
	PB12_EVENTOUT = 15,

	PB13_TIM1_CH1N = 1,
	PB13_SPI2_SCK = 5,
	PB13_I2S2_CK = 5,
	PB13_USART3_CTS = 7,
	PB13_CAN2_TX = 9,
	PB13_OTG_HS_ULPI_D6 = 10,
	PB13_ETH_MII_TXD1 = 11,
	PB13_EVENTOUT = 15,

	PB14_TIM1_CH2N = 1,
	PB14_TIM8_CH2N = 3,
	PB14_SPI2_MISO = 5,
	PB14_I2S2_EXT_SD = 6,
	PB14_USART3_RTS = 7,
	PB14_TIM12_CH1 = 9,
	PB14_OTG_HS_DM = 12,
	PB14_EVENTOUT = 15,

	PB15_RTC_REFIN = 0,
	PB15_TIM1_CH3N = 1,
	PB15_TIM8_CH3N = 3,
	PB15_SPI2_MOSI = 5,
	PB15_I2S2_SD = 5,
	PB15_TIM12_CH2 = 9,
	PB15_OTG_HS_DP = 12,
	PB15_EVENTOUT = 15,

	PC0_OTG_HS_ULPI_STP = 10,
	PC0_FMC_SDNWE = 12,
	PC0_EVENTOUT = 15,

	PC1_ETH_MDC = 11,
	PC1_EVENTOUT = 15,
	
	PC2_SPI2_MISO = 5,
	PC2_I2S2EXT_SD = 6,
	PC2_OTG_HS_ULPI_DIR = 10,
	PC2_ETH_MII_TXD2 = 11,
	PC2_FMC_SDNE0 = 12,
	PC2_EVENTOUT = 15,

	PC3_SPI2_MOSI = 5,
	PC3_I2S2_SD = 5,
	PC3_OTG_HS_ULPI_NXT = 10,
	PC3_ETH_MII_TX_CLK = 11,
	PC3_FMC_SDCKE0 = 12,
	PC3_EVENTOUT = 15,

	PC4_ETH_MII_RXD0 = 11,
	PC4_ETH_RMII_RXD0 = 11,
	PC4_EVENTOUT = 15,

	PC5_ETH_MII_RXD1 = 11,
	PC5_ETH_RMII_RXD1 = 11,
	PC5_EVENTOUT = 15,

