mymy49/yss/yss/inc/drv/gpio/define_gpio_stm32f4_f7_g4.h
	PC6_TIM3_CH1 = 2,
	PC6_TIM8_CH1 = 3,
	PC6_I2S2_MCK = 5,
	PC6_USART2_TX = 8,
	PC6_SDIO_D6 = 12,
	PC6_DCMI_D0 = 13,
	PC6_LCD_HSYNC = 14,
	PC6_EVENTOUT = 15,

	PC7_TIM3_CH2 = 2,
	PC7_TIM8_CH2 = 3,
	PC7_I2S3_MCK = 6,
	PC7_USART6_RX = 8,
	PC7_SDIO_D7 = 12,
	PC7_DCMI_D1 = 13,
	PC7_LCD_G6 = 14,
	PC7_EVENTOUT = 15,

	PC8_TIM3_CH3 = 2,
	PC8_TIM8_CH3 = 3,
	PC8_USART6_CK = 8,
	PC8_SDIO_D0 = 12,
	PC8_DCMI_D2 = 13,
	PC8_EVENTOUT = 15,

	PC9_MCO2 = 0,
	PC9_TIM3_CH4 = 2,
	PC9_TIM8_CH4 = 3,
	PC9_I2C3_SDA = 4,
	PC9_I2S_CKIN = 5,
	PC9_SDIO_D1 = 12,
	PC9_DCMI_D3 = 13,
	PC9_EVENTOUT = 15,

	PC10_SPI3_SCK = 6,
	PC10_I2S3_CK = 6,
	PC10_USART3_TX = 7,
	PC10_UART4_TX = 8,
	PC10_SDIO_D2 = 12,
	PC10_DCMI_D8 = 13,
	PC10_LCD_R2 = 14,
	PC10_EVENTOUT = 15,

	PC11_I2SEXT_SD = 5,
	PC11_SPI3_MISO = 6,
	PC11_USART3_RX = 7,
	PC11_UART4_RX = 8,
	PC11_SDIO_D3 = 12,
	PC11_DCMI_D4 = 13,
	PC11_EVENTOUT = 15,

	PC12_SPI3_MOSI = 6,
	PC12_I2S3_SD = 6,
	PC12_USART3_CK = 7,
	PC12_UART5_TX = 8,
	PC12_SDIO_CK = 12,
	PC12_DCMI_D9 = 13,
	PC12_EVENTOUT = 15,

	PC13_EVENTOUT = 15,

	PC14_EVENTOUT = 15,

	PC15_EVENTOUT = 15,

	PD0_CAN1_RX = 9,
	PD0_FMC_D2 = 12,
	PD0_EVENTOUT = 15,

	PD1_CAN1_TX = 9,
	PD1_FMC_D3 = 12,
	PD1_EVENTOUT = 15,

	PD2_TIM3_ETR = 2,
	PD2_UART5_RX = 8,
	PD2_SDIO_CMD = 12,
	PD2_DCMI_D11 = 13,
	PD2_EVENTOUT = 15,

	PD3_SPI2_SCK = 5,
	PD3_I2S2_CK = 5,
	PD3_USART2_CTS = 7,
	PD3_FMC_CLK = 12,
	PD3_DCMI_D5 = 13,
	PD3_LCD_G7 = 14,
	PD3_EVENTOUT = 15,

	PD4_USART2_RTS = 7,
	PD4_FMC_NOE = 12,
	PD4_EVENTOUT = 15,

	PD5_USART2_TX = 7,
	PD5_FMC_NWE = 12,
	PD5_EVENTOUT = 15,

	PD6_SPI3_MOSI = 5,
	PD6_I2S3_SD = 5,
	PD6_SAI1_SD_A = 6,
	PD6_USART2_RX = 7,
	PD6_FMC_NWAIT = 12,
	PD6_DCMI_D10 = 13,
	PD6_LCD_B2 = 14,
	PD6_EVENTOUT = 15,

	PD7_USART2_CK = 7,
	PD7_FMC_NE1 = 12,
	PD7_FMC_NCE2 = 12,
	PD7_EVENTOUT = 15,

	PD8_USART3_TX = 7,
	PD8_FMC_D13 = 12,
	PD8_EVENTOUT = 15,

	PD9_USART3_RX = 7,
	PD9_FMC_D14 = 12,
	PD9_EVENTOUT = 15,

	PD10_USART3_CK = 7,
	PD10_FMC_D15 = 12,
	PD10_LCD_B3 = 14,
	PD10_EVENTOUT = 15,

	PD11_USART3_CTS = 7,
	PD11_FMC_A16 = 12,
	PD11_EVENTOUT = 15,

	PD12_TIM4_CH1 = 2,
	PD12_USART3_RTS = 7,
	PD12_FMC_A17 = 12,
	PD12_EVENTOUT = 15,

	PD13_TIM4_CH2 = 2,
	PD13_FMC_A18 = 12,
	PD13_EVENTOUT = 15,

	PD14_TIM4_CH3 = 2,
	PD14_FMC_D0 = 12,
	PD14_EVENTOUT = 15,

	PD15_TIM4_4 = 2,
	PD15_FMC_D1 = 12,
	PD15_EVENTOUT = 15,

	PE0_TIM4_ETR = 2,
	PE0_UART8_RX = 8,
	PE0_FMC_NBL0 = 12,
	PE0_DCMI_D2 = 13,
	PE0_EVENTOUT = 15,

	PE1_UART8_TX = 8,
	PE1_FMC_NBL1 = 12,
	PE1_DCMI_D3 = 13,
	PE1_EVENTOUT = 15,

	PE2_TRACECLK = 0,
	PE2_SPI4_CLK = 5,
	PE2_SAI1_MCLK_A = 6,
	PE2_ETH_MII_TXD3 = 11,
	PE2_FMC_A23 = 12,
	PE2_EVENTOUT = 15,

	PE3_TRACED0 = 0,
	PE3_SAI1_SD_B = 6,
	PE3_FMC_A19 = 12,
	PE3_EVENTOUT = 15,

	PE4_TRACED1 = 0,
	PE4_SPI4_NSS = 5,
	PE4_SAI1_FS_A = 6,
	PE4_FMC_A20 = 12,
	PE4_DCMI_D4 = 13,
	PE4_LCD_B0 = 14,
	PE4_EVENTOUT = 15,

	PE5_TRACED2 = 0,
	PE5_TIM9_CH1 = 3,
	PE5_SPI4_MISO = 5,
	PE5_SAI1_SCK_A = 6,
	PE5_FMC_A21 = 12,
	PE5_DCMI_D6 = 13,
	PE5_LCD_G0 = 14,
	PE5_EVENTOUT = 15,

	PE6_TRACED3 = 0,
	PE6_TIM9_CH2 = 3,
	PE6_SPI4_MOSI = 5,
	PE6_SAI1_SD_A = 6,
	PE6_FMC_A22 = 12,
	PE6_DCMI_D7 = 13,
	PE6_LCD_G1 = 14,
	PE6_EVENTOUT = 15,

	PE7_TIM1_ETR = 1,
	PE7_UART7_RX = 8,
	PE7_FMC_D4 = 12,
	PE7_EVENTOUT = 15,

	PE8_TIM1_CH1N = 1,
	PE8_UART7_TX = 8,
	PE8_FMC_D5 = 12,
	PE8_EVENTOUT = 15,

	PE9_TIM1_CH1 = 1,
	PE9_FMC_D6 = 12,
	PE9_EVENTOUT = 15,

	PE10_TIM1_CH2N = 1,
	PE10_FMC_D7 = 12,
	PE10_EVENTOUT = 15,

	PE11_TIM1_CH2 = 1,
	PE11_SPI4_NSS = 5,
	PE11_FMC_D8 = 12,
	PE11_LCD_G3 = 14,
	PE11_EVENTOUT = 15,

	PE12_TIM1_CH3N = 1,
	PE12_SPI4_SCK = 5,
	PE12_FMC_D9 = 12,
	PE12_LCD_B4 = 14,
	PE12_EVENTOUT = 15,

	PE13_TIM1_CH3 = 1,
	PE13_SPI4_MISO = 5,
	PE13_FMC_D10 = 12,
	PE13_LCD_DE = 14,
	PE13_EVENTOUT = 15,

	PE14_TIM1_CH4 = 1,
	PE14_SPI4_MOSI = 5,
	PE14_FMC_D11 = 12,
	PE14_LCD_CLK = 14,
	PE14_EVENTOUT = 15,

	PE15_TIM1_BKIN = 1,
	PE15_FMC_D12 = 12,
	PE15_LCD_R7 = 14,
	PE15_EVENTOUT = 15,

	PF0_I2C2_SDA = 4,
	PF0_FMC_A0 = 12,
	PF0_EVENTOUT = 15,

	PF1_I2C2_SCL = 4,
	PF1_FMC_A1 = 12,
	PF1_EVENTOUT = 15,

	PF2_I2C2_SMBA = 4,
	PF2_FMC_A2 = 12,
	PF2_EVENTOUT = 15,

	PF3_FMC_A3 = 12,
	PF3_EVENTOUT = 15,

	PF4_FMC_A4 = 12,
	PF4_EVENTOUT = 15,

	PF5_FMC_A5 = 12,
	PF5_EVENTOUT = 15,

	PF6_TIM10_CH1 = 3,
	PF6_SPI5_NSS = 5,
	PF6_SAI1_SD_B = 6,
	PF6_UART7_RX = 8,
	PF6_FMC_NIORD = 12,
	PF6_EVENTOUT = 15,

	PF7_TIM11_CH1 = 3,
	PF7_SPI5_SCK = 5,
	PF7_SAI1_MCLK_B = 6,
	PF7_UART7_TX = 8,
	PF7_FMC_NREG = 12,
	PF7_EVENTOUT = 15,

	PF8_SPI5_MISO = 5,
	PF8_SAI1_SCK_B = 6,
	PF8_TIM13_CH1 = 9,
	PF8_FMC_NIOWR = 12,
	PF8_EVENTOUT = 15,

	PF9_SPI5_MOSI = 5,
	PF9_SAI1_FS_B = 6,
	PF9_TIM14_CH1 = 9,
	PF9_FMC_CD = 12,
	PF9_EVENTOUT = 15,

	PF10_FMC_INTR = 12,
	PF10_DCMI_D11 = 13,
	PF10_LCD_DE = 14,
	PF10_EVENTOUT = 15,

	PF11_SPI5_MOSI = 5,
	PF11_FMC_SDNRAS = 12,
	PF11_DCMI_D12 = 13,
	PF11_EVENTOUT = 15,

	PF12_FMC_A6 = 12,
	PF12_EVENTOUT = 15,

	PF13_FMC_A7 = 12,
	PF13_EVENTOUT = 15,

	PF14_FMC_A8 = 12,
	PF14_EVENTOUT = 15,

	PF15_FMC_A9 = 12,
	PF15_EVENTOUT = 15,

	PG0_FMC_A10 = 12,
	PG0_EVENTOUT = 15,

	PG1_FMC_A11 = 12,
	PG1_EVENTOUT = 15,

	PG2_FMC_A12 = 12,
	PG2_EVENTOUT = 15,

	PG3_FMC_A13 = 12,
	PG3_EVENTOUT = 15,

	PG4_FMC_A14 = 12,
	PG4_FMC_BA0 = 12,
	PG4_EVENTOUT = 15,

	PG5_FMC_A15 = 12,
	PG5_FMC_BA1 = 12,
	PG5_EVENTOUT = 15,
	
	PG6_FMC_INT2 = 12,
	PG6_DCMI_D12 = 13,
	PG6_LCD_R7 = 14,
	PG6_EVENTOUT = 15,

	PG7_USART6_CK = 8,
	PG7_FMC_INT3 = 12,
	PG7_DCMI_D13 = 13,
	PG7_LCD_CLK = 14,
	PG7_EVENTOUT = 15,

	PG8_SPI6_NSS = 5,
	PG8_USART6_RTS = 8,
	PG8_ETH_PPS_OUT = 11,
	PG8_FMC_SDCLK = 12,
	PG8_EVENTOUT = 15,

	PG9_USART6_RX = 8,
	PG9_FMC_NE2 = 12,
	PG9_FMC_NCE3 = 12,
	PG9_DCMI_VSYNC = 13,
	PG9_EVENTOUT = 15,

	PG10_LCD_G3 = 9,
	PG10_FMC_NCE4_1 = 12,
	PG10_FMC_NE3 = 12,
	PG10_DCMI_D2 = 13,
	PG10_LCD_B2 = 14,
	PG10_EVENTOUT = 15,

	PG11_ETH_MII_TX_EN = 11,
	PG11_ETH_RMII_TX_EN = 11,
	PG11_FMC_NCE4_2 = 12,
	PG11_DCMI_D3 = 13,
	PG11_LCD_B3 = 14,
	PG11_EVENTOUT = 15,

	PG12_SPI6_MISO = 5,
	PG12_USART6_RTS = 8,
	PG12_LCD_B4 = 9,
	PG12_FMC_NE4 = 12,
	PG12_LCD_B1 = 14,
	PG12_EVENTOUT = 15,

	PG13_SPI6_SCK = 5,
	PG13_USART6_CTS = 8,
	PG13_ETH_MII_TXD0 = 11,
	PG13_ETH_RMII_TXD0 = 11,
	PG13_FMC_A24 = 12,
	PG13_EVENTOUT = 15,

