mymy49/yss/yss/inc/drv/gpio/define_gpio_stm32f4_f7_g4.h
	PI3_TIM8_ETR = 3,
	PI3_SPI2_MOSI = 5,
	PI3_I2S2_SD = 5,
	PI3_FCM_D27 = 12,
	PI3_DCMI_D10 = 13,
	PI3_EVENTOUT = 15,

	PI4_TIM8_BKIN = 3,
	PI4_FMC_NBL2 = 12,
	PI4_DCMI_D5 = 13,
	PI4_LCD_B4 = 14,
	PI4_EVENTOUT = 15,

	PI5_TIM8_CH1 = 3,
	PI5_FMC_NBL3 = 12,
	PI5_DCMI_VSYNC = 13,
	PI5_LCD_B5 = 14,
	PI5_EVENTOUT = 15,

	PI6_TIM8_CH2 = 3,
	PI6_FMC_D28 = 12,
	PI6_DCMI_D6 = 13,
	PI6_LCD_B6 = 14,
	PI6_EVENTOUT = 15,

	PI7_TIM8_CH3 = 3,
	PI7_FMC_D29 = 12,
	PI7_DCMI_D7 = 13,
	PI7_LCD_B7 = 14,
	PI7_EVENTOUT = 15,

	PI8_EVENTOUT = 15,

	PI9_CAN1_RX = 9,
	PI9_FMC_D30 = 12,
	PI9_LCD_VSYNC = 14,
	PI9_EVENTOUT = 15,

	PI10_ETH_MII_RX_ER = 11,
	PI10_FMC_D31 = 12,
	PI10_LCD_HSYNC = 14,
	PI10_EVENTOUT = 15,

	PI11_OTG_HS_ULPI_DIR = 10,
	PI11_EVENTOUT = 15,

	PI12_LCD_HSYNC = 14,
	PI12_EVENTOUT = 15,

	PI13_LCD_VSYNC = 14,
	PI13_EVENTOUT = 15,

	PI14_LCD_CLK = 14,
	PI14_EVENTOUT = 15,

	PI15_LCD_R0 = 14,
	PI15_EVENTOUT = 15,

	PJ0_LCD_R1 = 14,
	PJ0_EVENTOUT = 15,

	PJ1_LCD_R2 = 14,
	PJ1_EVENTOUT = 15,

	PJ2_LCD_R3 = 14,
	PJ2_EVENTOUT = 15,

	PJ3_LCD_R4 = 14,
	PJ3_EVENTOUT = 15,

	PJ4_LCD_R5 = 14,
	PJ4_EVENTOUT = 15,

	PJ5_LCD_R6 = 14,
	PJ5_EVENTOUT = 15,

	PJ6_LCD_R7 = 14,
	PJ6_EVENTOUT = 15,

	PJ7_LCD_G0 = 14,
	PJ7_EVENTOUT = 15,

	PJ8_LCD_G1 = 14,
	PJ8_EVENTOUT = 15,

	PJ9_LCD_G2 = 14,
	PJ9_EVENTOUT = 15,

	PJ10_LCD_G3 = 14,
	PJ10_EVENTOUT = 15,

	PJ11_LCD_G4 = 14,
	PJ11_EVENTOUT = 15,

	PJ12_LCD_B0 = 14,
	PJ12_EVENTOUT = 15,

	PJ13_LCD_B1 = 14,
	PJ13_EVENTOUT = 15,

	PJ14_LCD_B2 = 14,
	PJ14_EVENTOUT = 15,

	PJ15_LCD_B3 = 14,
	PJ15_EVENTOUT = 15,

	PK0_LCD_G5 = 14,
	PK0_EVENTOUT = 15,

	PK1_LCD_G6 = 14,
	PK1_EVENTOUT = 15,

	PK2_LCD_G7 = 14,
	PK2_EVENTOUT = 15,

	PK3_LCD_B4 = 14,
	PK3_EVENTOUT = 15,

	PK4_LCD_B5 = 14,
	PK4_EVENTOUT = 15,

	PK5_LCD_B6 = 14,
	PK5_EVENTOUT = 15,

	PK6_LCD_B7 = 14,
	PK6_EVENTOUT = 15,

	PK7_LCD_DE = 14,
	PK7_EVENTOUT = 15,
};

#elif defined(STM32G4)

enum
{
	SYS_AF0 = 0,
	I2C4_AF0 = 0,

	LPTIM1_AF1 = 1,
	TIM2_AF1 = 1,
	TIM5_AF1 = 1,
	TIM15_AF1 = 1,
	TIM16_AF1 = 1,
	TIM17_AF1 = 1,

	I2C1_AF2 = 2,
	I2C3_AF2 = 2,
	TIM1_AF2 = 2,
	TIM2_AF2 = 2,
	TIM3_AF2 = 2,
	TIM4_AF2 = 2,
	TIM5_AF2 = 2,
	TIM8_AF2 = 2,
	TIM15_AF2 = 2,
	TIM20_AF2 = 2,
	COMP1_AF2 = 2,

	QUADSPI1_AF3 = 3,
	I2C3_AF3 = 3,
	I2C4_AF3 = 3,
	SAI1_AF3 = 3,
	USB_AF3 = 3,
	HRTIM1_AF3 = 3,
	TIM8_AF3 = 3,
	TIM15_AF3 = 3,
	TIM20_AF3 = 3,
	COMP3_AF3 = 3,

	I2C1_AF4 = 4,
	I2C2_AF4 = 4,
	I2C3_AF4 = 4,
	I2C4_AF4 = 4,
	TIM1_AF4 = 4,
	TIM8_AF4 = 4,
	TIM16_AF4 = 4,
	TIM17_AF4 = 4,

	QUADSPI1_AF5 = 5,
	SPI1_AF5 = 5,
	SPI2_AF5 = 5,
	SPI3_AF5 = 5,
	SPI4_AF5 = 5,
	I2S2_AF5 = 5,
	I2S3_AF5 = 5,
	I2C4_AF5 = 5,
	UART4_AF5 = 5,
	UART5_AF5 = 5,
	TIM8_AF5 = 5,
	Infrared_AF5 = 5,

	QUADSPI1_AF6 = 6,
	SPI2_AF6 = 6,
	SPI3_AF6 = 6,
	I2S2_AF6 = 6,
	I2S3_AF6 = 6,
	TIM1_AF6 = 6,
	TIM5_AF6 = 6,
	TIM8_AF6 = 6,
	TIM20_AF6 = 6,
	Infrared_AF6 = 6,

	USART1_AF7 = 7,
	USART2_AF7 = 7,
	USART3_AF7 = 7,
	FDCAN_AF7 = 7,
	COMP5_AF7 = 7,
	COMP6_AF7 = 7,
	COMP7_AF7 = 7,

	I2C3_AF8 = 8,
	I2C4_AF8 = 8,
	UART4_AF8 = 8,
	UART5_AF8 = 8,
	LPUART1_AF8 = 8,
	COMP1_AF8 = 8,
	COMP2_AF8 = 8,
	COMP3_AF8 = 8,
	COMP4_AF8 = 8,
	COMP5_AF8 = 8,
	COMP6_AF8 = 8,
	COMP7_AF8 = 8,

	FDCAN_AF9 = 9,
	TIM1_AF9 = 9,
	TIM8_AF9 = 9,
	TIM15_AF9 = 9,
	FDCAN1_AF9 = 9,
	FDCAN2_AF9 = 9,

	QUADSPI1_AF10 = 10,
	TIM2_AF10 = 10,
	TIM3_AF10 = 10,
	TIM4_AF10 = 10,
	TIM8_AF10 = 10,
	TIM17_AF10 = 10,

	LPTIM1_AF11 = 11,
	TIM1_AF11 = 11,
	TIM8_AF11 = 11,
	FDCAN1_AF11 = 11,
	FDCAN3_AF11 = 11,

	FMC_AF12 = 12,
	LPUART1_AF12 = 12,
	SAI1_AF12 = 12,
	HRTIM1_AF12 = 12,
	TIM1_AF12 = 12,

	SAI1_AF13 = 13,
	HRTIM1_AF13 = 13,
	OPAMP2_AF13 = 13,

	UART4_AF14 = 14,
	UART5_AF14 = 14,
	SAI1_AF14 = 14,
	TIM2_AF14 = 14,
	TIM15_AF14 = 14,
	UCPD1_AF14 = 14,

	EVENT_AF15 = 15
};
#elif defined(STM32L0)

enum
{
	SYS_AF0 = 0,
	SPI1_AF0 = 0,
	SPI2_AF0 = 0,
	I2S2_AF0 = 0,
	USART1_AF0 = 0,
	USART2_AF0 = 0,
	LPUART1_AF0 = 0,
	USB_AF0 = 0,
	LPTIM1_AF0 = 0,
	TSC_AF0 = 0,
	TIM2_AF0 = 0,
	TIM21_AF0 = 0,
	TIM22_AF0 = 0,
	EVENTOUT_AF0 = 0,

	SPI1_AF1 = 1,
	SPI2_AF1 = 1,
	I2S2_AF1 = 1,
	I2C1_AF1 = 1,
	LCD_AF1 = 1,
	TIM2_AF1 = 1,
	TIM21_AF1 = 1,

	SPI1_AF2 = 2,
	SPI2_AF2 = 2,
	I2S2_AF2 = 2,
	LPUART1_AF2 = 2,
	USART5_AF2 = 2,
	USB_AF2 = 2,
	LPTIM1_AF2 = 2,
	TIM2_AF2 = 2,
	TIM3_AF2 = 2,
	EVENTOUT_AF2 = 2,
	SYS_AF2 = 2,

	I2C1_AF3 = 3,
	TSC_AF3 = 3,
	EVENTOUT_AF3 = 3,

	I2C1_AF4 = 4,
	USART1_AF4 = 4,
	USART2_AF4 = 4,
	LPUART1_AF4 = 4,
	TIM3_AF4 = 4,
	TIM22_AF4 = 4,
	EVENTOUT_AF4 = 4,

	SPI2_AF5 = 5,
	I2S2_AF5 = 5,
	I2C2_AF5 = 5,
	USART1_AF5 = 5,
	TIM21_AF5 = 5,
	EVENTOUT_AF5 = 5,

	I2C1_AF6 = 6,
	I2C2_AF6 = 6,
	LPUART1_AF6 = 6,
	USART4_AF6 = 6,
	UASRT5_AF6 = 6,
	TIM21_AF6 = 6,
	EVENTOUT_AF6 = 6,

	I2C3_AF7 = 7,
	LPUART1_AF7 = 7,
	COMP1_AF7 = 7,
	COMP2_AF7 = 7,
	TIM3_AF7 = 7
};

#elif defined(STM32F0)

enum
{
	PA0_USART1_CTS = 1,
	PA0_USART2_CTS = 1,
	PA0_UART4_TX = 4,

	PA1_EVENT_OUT = 0,
	PA1_USART1_RTS = 1,
	PA1_USART2_RTS = 1,
	PA1_UART4_RX = 4,
	PA1_TIM15_CH1N = 5,

	PA2_TIM15_CH1 = 0,
	PA2_USART1_TX = 1,
	PA2_USART2_TX = 1,

	PA3_TIM15_CH2 = 0,
	PA3_USART1_RX = 1,
	PA3_USART2_RX = 1,

	PA4_SPI1_NSS = 0,
	PA4_USART1_CK = 1,
	PA4_USART2_CK = 1,
	PA4_TIM14_CH1 = 4,
	PA4_USART6_TX = 5,

	PA5_SPI1_SCK = 0,
	PA5_USART6_RX = 5,

	PA6_SPI1_MISO = 0,
	PA6_TIM3_CH1 = 1,
	PA6_TIM1_BKIN = 2,
	PA6_USART3_CTS = 4,
	PA6_TIM16_CH1 = 5,
	PA6_EVENTOUT = 6,

	PA7_SPI1_MOSI = 0,
	PA7_TIM3_CH2 = 1,
	PA7_TIM1_CH1N = 2,
	PA7_TIM14_CH1 = 4,
	PA7_TIM17_CH1 = 5,
	PA7_EVENTOUT = 6,

	PA8_MCO = 0,
	PA8_USART1_CK = 1,
	PA8_TIM1_CH1 = 2,
	PA8_EVENTOUT = 3,

	PA9_TIM15_BKIN = 0,
	PA9_USART1_TX = 1,
	PA9_TIM1_CH2 = 2,
	PA9_I2C1_SCL = 4,
	PA9_MCO = 5,

	PA10_TIM17_BKIN = 0,
	PA10_USART1_RX = 1,
	PA10_TIM1_CH3 = 2,
	PA10_I2C1_SDA = 4,

	PA11_EVENTOUT = 0,
	PA11_USART1_CTS = 1,
	PA11_TIM1_CH4 = 2,
	PA11_SCL = 5,

	PA12_EVENTOUT = 0,
	PA12_USART1_RTS = 1,
	PA12_TIM1_ETR = 2,
	PA12_SDA = 5,

	PA13_SWDIO = 0,
	PA13_IR_OUT = 1,

	PA14_SWCLK = 0,
	PA14_USART1_TX = 1,
	PA14_USART2_TX = 1,

	PA15_SPI1_NSS = 0,
	PA15_USART1_RX = 1,
	PA15_USART2_RX = 1,

	PB0_EVENTOUT = 0,
	PB0_TIM3_CH3 = 1,
	PB0_TIM1_CH2N = 2,
	PB0_USART3_CK = 4,

	PB1_TIM14_CH1 = 0,
	PB1_TIM3_CH4 = 1,
	PB1_TIM1_CH3N = 2,
	PB1_USART3_RTS = 4,

