mymy49/yss/yss/inc/drv/gpio/define_gpio_stm32f4_f7_g4.h
	PB3_SPI1_SCK = 0,
	PB3_EVENTOUT = 1,
	PB3_USART5_TX = 4,

	PB4_SPI1_MISO = 0,
	PB4_TIM3_CH1 = 1,
	PB4_EVENTOUT = 2,
	PB4_USART5_RX = 4,
	PB4_TIM17_BKIN = 5,

	PB5_SPI1_MOSI = 0,
	PB5_TIM3_CH2 = 1,
	PB5_TIM16_BKIN = 2,
	PB5_I2C1_SMBA = 3,
	PB5_USART5_CK_RTS = 4,

	PB6_USART1_TX = 0,
	PB6_I2C1_SCL = 1,
	PB6_TIM16_CH1N = 2,

	PB7_USART1_RX = 0,
	PB7_I2C1_SDA = 1,
	PB7_TIM17_CH1N = 2,
	PB7_USART4_CTS = 4,

	PB8_I2C1_SCL = 1,
	PB8_TIM16_CH1 = 2,

	PB9_IR_OUT = 0,
	PB9_I2C1_SDA = 1,
	PB9_TIM17_CH1 = 2,
	PB9_EVENTOUT = 3,
	PB9_SPI2_NSS = 5,

	PB10_I2C1_SCL = 1,
	PB10_I2C2_SCL = 1,
	PB10_USART3_TX = 4,
	PB10_SPI2_SCK = 5,

	PB11_EVENTOUT = 0,
	PB11_I2C1_SDA = 1,
	PB11_I2C2_SDA = 1,
	PB11_USART3_RX = 4,

	PB12_SPI1_NSS = 0,
	PB12_SPI2_NSS = 0,
	PB12_EVENTOUT = 1,
	PB12_TIM1_BKIN = 2,
	PB12_USART3_RTS = 4,
	PB12_TIM15 = 5,

	PB13_SPI1_SCK = 0,
	PB13_SPI2_SCK = 0,
	PB13_TIM1_CH1N = 2,
	PB13_USART3_CTS = 4,
	PB13_I2C2_SCL = 5,

	PB14_SPI1_MISO = 0,
	PB14_SPI2_MISO = 0,
	PB14_TIM15_CH1 = 1,
	PB14_TIM1_CH2N = 2,
	PB14_USART3_RTS = 4,
	PB14_I2C2_SDA = 5,

	PB15_SPI1_MOSI = 0,
	PB15_SPI2_MOSI = 0,
	PB15_TIM15_CH2 = 1,
	PB15_TIM1_CH3N = 2,
	PB15_TIM15_CH1N = 3,

	PC0_EVENTOUT = 0,
	PC0_USART6_TX = 2,

	PC1_EVENTOUT = 0,
	PC1_USART6_RX = 2,

	PC2_EVENTOUT = 0,
	PC2_SPI2_MISO = 1,

	PC3_EVENTOUT = 0,
	PC3_SPI2_MOSI = 1,

	PC4_EVENTOUT = 0,
	PC4_USART3_TX = 1,

	PC5_USART3_RX = 1,

	PC6_TIM3_CH1 = 0,

	PC7_TIM3_CH2 = 0,

	PC8_TIM3_CH3 = 0,

	PC9_TIM3_CH4 = 0,

	PC10_USART4_TX = 0,
	PC10_USART3_TX = 1,

	PC11_USART4_RX = 0,
	PC11_USART3_RX = 1,

	PC12_USART4_CK = 0,
	PC12_USART3_CK = 1,
	PC12_USART5_TX = 2,

	PD2_TIM3_ETR = 0,
	PD2_USART3_RTS = 1,
	PD2_USART5_RX = 2,

	PF0_I2C1_SDA = 0,

	PF1_I2C1_SCL = 1,

	PF4_EVENTOUT = 0,

	PF5_EVENTOUT = 0,

	PF6_I2C1_SCL = 0,
	PF6_I2C2_SCL = 0,

	PF7_I2C1_SDA = 0,
	PF7_I2C2_SDA = 0,
};
#endif
}

namespace ospeed
{
enum
{
	LOW = 0,
	MID = 1,
	FAST = 2,
	HIGH = 3,
};
}

namespace otype
{
enum
{
	PUSH_PULL = 0,
	OPEN_DRAIN = 1,
};
}

namespace mode
{
enum
{
	INPUT = 0,
	OUTPUT = 1,
	ALT_FUNC = 2,
	ANALOG = 3
};
}

namespace pupd
{
enum
{
	NONE = 0,
	PULL_UP = 1,
	PULL_DOWN = 2
};
}

namespace exti
{
enum
{
	PORTA = 0,
	PORTB = 1,
	PORTC = 2,
	PORTD = 3,
	PORTE = 4,
	PORTF = 5,
	PORTG = 6,
	PORTH = 7,
	PORTI = 8,
	PORTJ = 9,
	PORTK = 10
};
}

}
}

#endif

#endif